
** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import seaborn as sns

  # Import models from scikit learn module:
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.metrics import confusion_matrix, classification_report, accuracy_score, precision_score, recall_score, f1_score
  from sklearn.preprocessing import StandardScaler
  from scipy.stats import zscore

  df = pd.read_csv('breast_cancer_data.csv')

  # Encode malignant as 1, benign as 0
  df['diagnosis'] = df['diagnosis'].replace({'M':1, 'B':0})

  # Imports/load data
  predictor_var = ['radius_mean', 'texture_mean', 'perimeter_mean', 'area_mean', 'smoothness_mean', 'compactness_mean', 'concavity_mean', 'concave points_mean', 'symmetry_mean', 'fractal_dimension_mean']

  #print(df.head())

  # Print distinct diagnosis values and frequency in dataset
  print(df['diagnosis'].value_counts())

  # Test if the number of unique IDs is equal to sample size, i.e. no repeated patients
  print(df['id'].nunique())
  print(df['id'].count())

  unique_ids = df.id.nunique()==df.id.count()
  print(unique_ids)

  # At a maximum, there should be no more than the smallest size class divided by 10 number of features
  max_features = min(df['diagnosis'].value_counts() / 10)
  print(max_features)

  # See which features have extreme outliers
  sns.boxplot(data=np.log(df[predictor_var]+.01).apply(zscore))
  plt.xticks(rotation=45);
  plt.show()
  plt.close()

  #5. Uncomment the code to remove the samples with extreme fractal_dimensions_mean values:
  q_hi  = df["fractal_dimension_mean"].quantile(0.99)
  df_filtered = df[(df["fractal_dimension_mean"] < q_hi)]
  
  #6. Run the boxplot again but with the filtered dataframe:
  sns.boxplot(data=np.log(df_filtered[predictor_var]+.01).apply(zscore))
  plt.xticks(rotation=45);
  plt.show()
  plt.close()

#+end_src

#+RESULTS:
: diagnosis
: 0    357
: 1    212
: Name: count, dtype: int64
: 569
: 569
: True
: 21.2

** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import seaborn as sns

  # Import models from scikit learn module:
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.metrics import confusion_matrix, classification_report, accuracy_score, precision_score, recall_score, f1_score

  df = pd.read_csv('breast_cancer_data.csv')

  #encode malignant as 1, benign as 0
  df['diagnosis'] = df['diagnosis'].replace({'M':1, 'B':0})
  predictor_var = ['radius_mean', 'texture_mean', 'compactness_mean', 'symmetry_mean']

  outcome_var = 'diagnosis'

  x_train, x_test, y_train, y_test = train_test_split(df[predictor_var], df[outcome_var], random_state=0, test_size=0.3)

  # Fit a Logistic Regression model with the specified hyperpatameters
  log_reg = LogisticRegression(penalty='none', fit_intercept=True)
  print(log_reg.get_params())

  # Fit the model to the training data and obtain coefficients and intercept
  log_reg.fit(x_train, y_train)
  coefficients = log_reg.coef_
  intercept = log_reg.intercept_
  print('coefficients: ', coefficients)
  print('intercept: ', intercept)

  # Calculate the accuracy, precision, recall and f1-score on the testing data
  y_pred = log_reg.predict(x_test)
  accuracy = accuracy_score(y_test, y_pred)
  precision = precision_score(y_test, y_pred)
  recall = recall_score(y_test, y_pred)
  f1 = f1_score(y_test, y_pred)

  print(f'Test set accuracy:\t{accuracy}')
  print(f'Test set precision:\t{precision}')
  print(f'Test set recall:\t{recall}')
  print(f'Test set f1-score:\t{f1}')

  # Remove the comments from the following code block to print the confusion matrix
  test_conf_matrix = pd.DataFrame(
      confusion_matrix(y_test, y_pred),
      index=['actual no', 'actual yes'],
      columns=['predicted no', 'predicted yes']
       )
  print(test_conf_matrix)

#+end_src

#+RESULTS:
#+begin_example
{'C': 1.0, 'class_weight': None, 'dual': False, 'fit_intercept': True, 'intercept_scaling': 1, 'l1_ratio': None, 'max_iter': 100, 'multi_class': 'auto', 'n_jobs': None, 'penalty': 'none', 'random_state': None, 'solver': 'lbfgs', 'tol': 0.0001, 'verbose': 0, 'warm_start': False}
coefficients:  [[ 1.07991529  0.28744917 30.96010078 29.97251652]]
intercept:  [-30.15566409]
Test set accuracy:	0.9064327485380117
Test set precision:	0.8507462686567164
Test set recall:	0.9047619047619048
Test set f1-score:	0.8769230769230769
            predicted no  predicted yes
actual no             98             10
actual yes             6             57
#+end_example

** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np

  #Import models from scikit learn module:
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import LogisticRegression
  from sklearn.metrics import confusion_matrix

  df = pd.read_csv('breast_cancer_data.csv')
  #encode malignant as 1, benign as 0

  df['diagnosis'] = df['diagnosis'].replace({'M':1, 'B':0})
  predictor_var = ['radius_mean', 'texture_mean', 'compactness_mean', 'symmetry_mean',]
  outcome_var = 'diagnosis'

  x_train, x_test, y_train, y_test = train_test_split(df[predictor_var], df[outcome_var], random_state=0, test_size=0.3)

  log_reg = LogisticRegression(penalty=None,
                               fit_intercept=True,
                               tol=0.0000001,
                               solver='newton-cg')
  log_reg.fit(x_train, y_train)
  y_pred = log_reg.predict(x_test)
  y_pred_prob = log_reg.predict_proba(x_test)

  #Using the predicted probabilities to get the predicted class
  y_pred_class = (y_pred_prob[:,1]>0.5)*1.0

  #Check if it's the same as y_pred
  diff = np.array_equal(y_pred_class, y_pred)
  print(diff)

  #Print the confusion matrix
  print("Confusion Matrix: Threshold 50%")
  cm_50 = confusion_matrix(y_test, y_pred_class)
  print(cm_50)

  ## Confusion matrices for thresholds of 0.25 and 0.75
  y_pred_class = (y_pred_prob[:,1]>0.25)*1.0
  print("Confusion Matrix: Threshold 25%")
  cm_25 = confusion_matrix(y_test, y_pred_class)
  print(cm_25)

  y_pred_class = (y_pred_prob[:,1]>0.75)*1.0
  print("Confusion Matrix: Threshold 75%")
  cm_75 = confusion_matrix(y_test, y_pred_class)
  print(cm_75)

#+end_src

#+RESULTS:
#+begin_example
True
Confusion Matrix: Threshold 50%
[[98 10]
 [ 6 57]]
Confusion Matrix: Threshold 25%
[[94 14]
 [ 2 61]]
Confusion Matrix: Threshold 75%
[[104   4]
 [ 11  52]]
#+end_example
